import pytest


@pytest.fixture
def fixture_dict() -> dict:
    """Фикстура для тестирования поиска в словаре"""
    return {"a": 1, "b": {"c": 2, "d": {"e": 213.60, "f": 4}}, "g": 5}


@pytest.fixture
def fixture_transaction() -> list[dict]:
    """Фикстура для тестирования поиска в словаре"""
    return [
        {
            "Дата операции": "17.12.2020 14:06:11",
            "Дата платежа": "17.12.2020",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -15000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -15000.0,
            "Категория": "Автоуслуги",
            "MCC": 5511.0,
            "Описание": "Kia Odisseya-Spb",
            "Бонусы (включая кэшбэк)": 300,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 15000.0,
        }
    ]
